Revit 2027 API
RevitLinkType.CreateFromIFC Method
Overload List
Name | Description
CreateFromIFC(Document, ExternalResourceReference, String, Boolean, RevitLinkOptions) |  Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file.
CreateFromIFC(Document, String, String, Boolean, RevitLinkOptions) |  Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file.
Top
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace